### Plan for staging
🟡 Modify module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"]
🟡 Modify module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"]
🟡 Modify module.ab_testing.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.appmesh
🟡 Modify module.ab_testing.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.canary[0]
🟠 Replace aws_dynamodb_table.ab_test_participants
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**0 to add, 4 to modify, 4 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # aws_dynamodb_table.ab_test_participants must be replaced
-/+ resource "aws_dynamodb_table" "ab_test_participants" {
      ~ arn                         = "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ hash_key                    = "resourceId" -> "participantId" # forces replacement
      ~ id                          = "ab_test_participants" -> (known after apply)
        name                        = "ab_test_participants"
      + stream_arn                  = (known after apply)
      - stream_enabled              = false -> null
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
        tags                        = {
            "Terraform"  = "true"
            "table_name" = "ab_test_participants"
            "team"       = "multi-product"
        }
        # (5 unchanged attributes hidden)

      - attribute {
          - name = "resourceId" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "participantId"
          + type = "S"
        }

      ~ server_side_encryption {
          + kms_key_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      - ttl {
          - enabled = false -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"] will be updated in-place
  ~ resource "aws_glue_schema" "event_glue_schema" {
        id                    = "arn:aws:glue:eu-west-1:545209064596:schema/automotive/AbTestChangeEvent"
      ~ schema_definition     = jsonencode(
          ~ {
              ~ properties = {
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  - resourceId      = {
                      - description = "The ID of the quote."
                      - type        = "string"
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"] will be updated in-place
  ~ resource "aws_glue_schema" "event_glue_schema" {
        id                    = "arn:aws:glue:eu-west-1:545209064596:schema/automotive/AbTestParticipantAllocationEvent"
      ~ schema_definition     = jsonencode(
          ~ {
              ~ properties = {
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  - resourceId      = {
                      - description = "The ID of the quote."
                      - type        = "string"
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "1504255815388863351" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T10:33:28Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "4474837381118083804" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T10:33:28Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.9-48" -> "0.0.10-54"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.9-48" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.10-54"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.9-48" -> "0.0.10-54"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.9-48" -> "0.0.10-54"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ab_testing.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.appmesh will be updated in-place
  ~ resource "aws_appmesh_virtual_node" "appmesh" {
        id                = "4010625b-2fe0-4a88-a61b-ba42afd43547"
        name              = "ab-testing"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ spec {
          + backend {
              + virtual_service {
                  + virtual_service_name = "feature-flags-ii.local"
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.ab_testing.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.canary[0] will be updated in-place
  ~ resource "aws_appmesh_virtual_node" "canary" {
        id                = "2f6c7f9a-18a5-4a66-a6c6-5aca5e063164"
        name              = "ab-testing-canary"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ spec {
          + backend {
              + virtual_service {
                  + virtual_service_name = "feature-flags-ii.local"
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 4 to add, 4 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>